content/posts/Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014.md
+++
title = "Quantum Field Theory for the Gifted Amateur by Lancaster and Blundell in 2014"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:41-04:00
slug = "Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014"
draft = false
+++

## 0. Overture {#0-dot-overture}


## I. The Universe as a set of harmonic oscillators {#i-dot-the-universe-as-a-set-of-harmonic-oscillators}


### 1. Lagrangians {#1-dot-lagrangians}


### 2. Simple harmonic oscillators {#2-dot-simple-harmonic-oscillators}


### 3. Occupation number representation {#3-dot-occupation-number-representation}


### 4. Making second quantization work {#4-dot-making-second-quantization-work}


## II. Writing down Lagrangians {#ii-dot-writing-down-lagrangians}


### 5. Continuous systems {#5-dot-continuous-systems}


### 6. A first stab at relativistic quantum mechanics {#6-dot-a-first-stab-at-relativistic-quantum-mechanics}


### 7. Examples of Lagrangians, or how to write down a theory {#7-dot-examples-of-lagrangians-or-how-to-write-down-a-theory}


## III. The need for quantum fields {#iii-dot-the-need-for-quantum-fields}


### 8. The passage of time {#8-dot-the-passage-of-time}


### 9. Quantum mechanical transformations {#9-dot-quantum-mechanical-transformations}


### 10. Symmetry {#10-dot-symmetry}


### 11. Canonical quantization of fields {#11-dot-canonical-quantization-of-fields}


### 12. Examples of canonical quantization {#12-dot-examples-of-canonical-quantization}


### 13. Fields with many components and massive electromagnetism {#13-dot-fields-with-many-components-and-massive-electromagnetism}


### 14. Gauge fields and gauge theory {#14-dot-gauge-fields-and-gauge-theory}


### 15. Discrete transformations {#15-dot-discrete-transformations}


## IV. Propagators and perturbations {#iv-dot-propagators-and-perturbations}


### 16. Propagators and Green's functions {#16-dot-propagators-and-green-s-functions}


### 17. Propagators and fields {#17-dot-propagators-and-fields}


### 18. The S-matrix {#18-dot-the-s-matrix}


### 19. Expanding the S-matrix: Feynman diagrams {#19-dot-expanding-the-s-matrix-feynman-diagrams}


### 20. Scattering theory {#20-dot-scattering-theory}


## V. Interlude: wisdom from statistical physics {#v-dot-interlude-wisdom-from-statistical-physics}


### 21. Statistical physics: a crash course {#21-dot-statistical-physics-a-crash-course}


### 22. The generating functional for fields {#22-dot-the-generating-functional-for-fields}


## VI. Path integrals {#vi-dot-path-integrals}


## VII. Topological ideas {#vii-dot-topological-ideas}


## VIII. Renormalization:taming the infinite {#viii-dot-renormalization-taming-the-infinite}


### 31. Renormalization, quasiparticles and the Fermi surface {#31-dot-renormalization-quasiparticles-and-the-fermi-surface}

<!--list-separator-->

-  31.1 Recap: interacting and non-interacting theories

<!--list-separator-->

-  31.2 Quasiparticles

<!--list-separator-->

-  31.3 The propagator for a dressed particle

<!--list-separator-->

-  31.4 Elementary quasiparticles in a metal

<!--list-separator-->

-  31.5 The Landau Fermi liquid


### 32. Renormalization: the problem and its solution {#32-dot-renormalization-the-problem-and-its-solution}

<!--list-separator-->

-  32.1 The problem is divergences

<!--list-separator-->

-  32.2 The solution is counterterms

<!--list-separator-->

-  32.3 How to tame an integral

<!--list-separator-->

-  32.4 What counterterms mean

<!--list-separator-->

-  32.5 Making renormalization even simpler

<!--list-separator-->

-  32.6 Which theories are renormalizable?


### 33. Renormalization in action: propagators and Feynman diagrams {#33-dot-renormalization-in-action-propagators-and-feynman-diagrams}

<!--list-separator-->

-  33.1 How interactions change the propagator in perturbation theory

<!--list-separator-->

-  33.2 The role of counterterms: renormalization conditions

<!--list-separator-->

-  33.3 The vertex function


### 34. The renormalization group {#34-dot-the-renormalization-group}

<!--list-separator-->

-  34.1 The problem

<!--list-separator-->

-  34.2 Flows in parameter space

<!--list-separator-->

-  34.3 The renormalization group method

<!--list-separator-->

-  34.4 Application 1: asymptotic freedom

<!--list-separator-->

-  34.5 Application 2: Anderson localization

<!--list-separator-->

-  34.6 Application 3: the Kosterlitz-Thouless transition


### 35. Ferromagnetism: a renormalization group tutorial {#35-dot-ferromagnetism-a-renormalization-group-tutorial}

<!--list-separator-->

-  35.1 Background: critical phenomena and scaling

<!--list-separator-->

-  35.2 The ferrogmagnetic transition and critical phenomena


## IX. Putting a spin on QFT {#ix-dot-putting-a-spin-on-qft}


### 36. The Dirac equation {#36-dot-the-dirac-equation}

<!--list-separator-->

-  36.1 The Dirac equation

<!--list-separator-->

-  36.2 Massless particles: left\* and right-handed wave functions

<!--list-separator-->

-  36.3 Dirac and Weyl [spinors]({{< relref "spinors" >}})

<!--list-separator-->

-  36.4 Basis states for superpositions

<!--list-separator-->

-  36.5 The non-relativistic limit of the Dirac equation


### 37. How to transform a spinor {#37-dot-how-to-transform-a-spinor}

<!--list-separator-->

-  37.1 [spinors]({{< relref "spinors" >}}) aren't vectors

<!--list-separator-->

-  37.2 Rotating [spinors]({{< relref "spinors" >}})

<!--list-separator-->

-  37.3 Boosting [spinors]({{< relref "spinors" >}})

<!--list-separator-->

-  37.4 Why are there four components in the Dirac equation?


### 38. The quantum Dirac field {#38-dot-the-quantum-dirac-field}

<!--list-separator-->

-  38.1 Canonical quantization and Noether current

<!--list-separator-->

-  38.2 The fermion propagator

<!--list-separator-->

-  38.3 Feynman rules and scattering

<!--list-separator-->

-  38.4 Local symmetry and aguage theory for fermions


### 39. A rough guide to quantum electrodynamics {#39-dot-a-rough-guide-to-quantum-electrodynamics}

<!--list-separator-->

-  39.1 Quantum light and the photon propagator

<!--list-separator-->

-  39.2 Feynman rules and a first QED process

<!--list-separator-->

-  39.3 Gauge invariance in QED


### 40. QED scattering: three famous cross-sections {#40-dot-qed-scattering-three-famous-cross-sections}

<!--list-separator-->

-  40.1 Example 1: Rutherford scattering

<!--list-separator-->

-  40.2 Example 2: Spin sums and the Mott formula

<!--list-separator-->

-  40.3 Example 3: Compton scattering

<!--list-separator-->

-  40.4 Crossing symmetry


### 41. The renormalization of QED and two great results {#41-dot-the-renormalization-of-qed-and-two-great-results}

<!--list-separator-->

-  41.1 Renormalizing the photon propagator: dielectric vacuum

<!--list-separator-->

-  41.2 The renormalization group and the electric charge

<!--list-separator-->

-  41.3 Vertex corrections and the electron g-factor


## X. Some applications from the world of condensed matter {#x-dot-some-applications-from-the-world-of-condensed-matter}


### 42. Superfluids {#42-dot-superfluids}


### 43. The many-body problem and the metal {#43-dot-the-many-body-problem-and-the-metal}


### 44. Superconductors {#44-dot-superconductors}


### 45. The fractional quantum Hall fluid {#45-dot-the-fractional-quantum-hall-fluid}


## XI. Some applications from the world of particle physics {#xi-dot-some-applications-from-the-world-of-particle-physics}


### 46. Non-abelian gauge theory {#46-dot-non-abelian-gauge-theory}


### 47. The Weinberg-Salam model {#47-dot-the-weinberg-salam-model}


### 48. Majorana fermions {#48-dot-majorana-fermions}


### 49. Magnetic monopoles {#49-dot-magnetic-monopoles}


### 50. Instantons, tunnelling and the end of the world {#50-dot-instantons-tunnelling-and-the-end-of-the-world}
